<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"83fdb77dc4a6eb0fd5e8687fbf84fe765dc6e4d214aadc537f337baa0415d065","plan_job_ref":"Job PR Plan #17 at https://github.com/tyng94/tyng94/actions/runs/6987442226","plan_hash":"345abd7230cc0b8db7d1a05b13b4696cb111da5c065d50381ebe8900f050d434","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in ___infrastructure__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "*********************"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default_vpc_security_group_id = (known after apply)
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #12](https://github.com/tyng94/tyng94/actions/runs/6987446887)